import {
  RulsWrp,
  ExampleStyled,
  ExampleWrp,
  HintList,
  PhotoWrp,
} from './Ruls.styled';
import iphoneOne from '../../assets/iphoneOne.jpeg';
import iphoneTwo from '../../assets/iphoneTwo.jpeg';
import iphoneThree from '../../assets/iphoneThree.jpeg';

export const Ruls = () => {
  return (
    <RulsWrp>
      <h3>
        Основні правила <br />
        для користувача каналу <br />
        “Купи | Продай | Україна 🇺🇦”
      </h3>
      <ol>
        <li>
          Канал дозволяє розміщення оголошень про купівлю/продаж різних товарів
          в Україні які передбачені законом.
        </li>
        <li>
          Всі оголошення повинні містити достовірну інформацію, яка відповідає
          дійсному стану товару.
        </li>
        <li>
          Заборонено розміщення оголошення що протирічать законодавству або
          моральним нормам.
        </li>
        <li>
          Заборонено публікувати оголошення, що містять образливу або неналежну
          мову, а також контент, що порушує авторські права.
        </li>
        <li>
          Не використовувати канал для здійснення незаконних дій, включаючи
          торгівлю контрабандними або краденими товарами.
        </li>
        <li>
          Заборонено здійснювати обмін грошима або фінансовими інструментами на
          каналі. Оголошення повинні стосуватись лише купівлі/продажу товарів.
        </li>
        <li>
          Адміністрація каналу має право видаляти оголошення/бан користувача
          якщо вони не відповідають правилам або порушують інтереси користувачів
          (зброя, наркотики, порнографія, насилля, нецензурна лексика, посилання
          на інші ресурси)
        </li>
        <li>
          <b>Повідомлення про шахрайство: </b>
          Якщо ви помітили підозрілу діяльність або шахрайство, повідомте
          адміністрацію каналу негайно.
        </li>
        <li>
          <b>Одне оголошення на один товар: </b>
          Заборонено дублювати оголошення для одного товару. Розміщення одного
          оголошення від користувача дозволено 1 раз на 6 годин.
        </li>
        <li>
          <b>Заборона рекламних оголошень: </b>
          Канал призначений для особистих угод між користувачами. Рекламні
          оголошення та пропозиції бізнесів узгоджуються з адміністраторами
          каналу.
        </li>
        <li>
          <b>Заборона спаму: </b>
          Заборонено надсилати небажану пошту або повідомлення іншим
          користувачам, що не стосуються конкретних оголошень.
        </li>
        <li>
          Вказуйте точну інформацію щодо ціни, стану товару, його характеристик,
          місцезнаходження та інших важливих деталей. Це допоможе уникнути
          недорозумінь та покращити сервіс для користувачів.
        </li>
        <li>
          Заборонено використання ботів або автоматизованих програм для
          розміщення оголошень або здійснення угод. Всі оголошення та угоди
          мають здійснюватись вручну.
        </li>
        <li>
          Будьте обережні під час здійснення угод. Рекомендується перевіряти
          автентичність та достовірність інформації про продавців або покупців,
          проводити зустрічі в безпечних місцях та використовувати безпечні
          способи оплати.
        </li>
        <li>
          Адміністрація каналу може змінювати правила у будь-який час. Будьте в
          курсі оновлень та відповідайте їм.
        </li>
        <li>
          Будь ласка, допомагайте адміністрації каналу підтримувати порядок та
          відповідність правилам шляхом повідомлення про порушення або спам.
        </li>
        <li>
          <b>
            Адміністрація каналу не несе відповідальності щодо чесності
            продавця/покупця ‼️
          </b>
        </li>
      </ol>

      <h3>
        Правила розміщення оголошень <br />
        на каналі <br />
        “Купи | Продай | Україна 🇺🇦”
      </h3>
      <ExampleWrp>
        <ExampleStyled>
          <li>
            <b>Заголовок</b>
            <HintList>
              <li>напишіть першим словом категорію оголошення</li>
              <li>напишіть ключову назву товару</li>
            </HintList>
          </li>
          <li>
            <b>Опис товару</b>
            <HintList>
              <li>вкажіть основні характеристики</li>
              <li>вкажіть стан</li>
              <li>вкажіть комплектацію</li>
              <li>якщо є можливість торгу, вкажіть</li>
            </HintList>
          </li>
          <li>
            <b>Вартість</b>
            <HintList>
              <li>
                вкажіть ціну товару <br /> (лише для продажу)
              </li>
            </HintList>
          </li>
          <b>Контактна інформація</b>
          <HintList>
            <li>вкажіть телеграм</li>
            <li>
              вкажіть номер телефону <br /> (за бажанням)
            </li>
          </HintList>

          <li>
            <b>Фото</b>
            <HintList>
              <li>додайте до 5 шт з різних кутів</li>
              <li>розмір одного фото менше 10мб</li>
            </HintList>
          </li>
          <li>
            <b>Коректне форматування</b>
            <HintList>
              <li>оголошення повинні бути написані чітко та лаконічно</li>
              <li>
                використовуйте заголовки, пункти, нумерацію для кращої
                читабельності
              </li>
            </HintList>
          </li>
        </ExampleStyled>

        <ExampleStyled>
          <h3>Приклад</h3>
          <li>
            <b>Заголовок:</b> Продам Iphone 12, 64 ГБ.
          </li>
          <li>
            <b>Опис товару:</b> Червоний колір, зарядний пристрій, коробка,
            запасні 2 скла на екран, стан ідеальний. Ціна остаточна.
          </li>
          <li>
            <b>Вартість:</b> 15000
          </li>
          <b>Контактна інформація:</b> <br />
          @gta-cat/0639999999
          <li>
            <b>Фото:</b>
            <PhotoWrp>
              <li>
                <img
                  src={iphoneOne}
                  alt="iphone"
                  width="100"
                  height="100"
                ></img>
              </li>
              <li>
                <img
                  src={iphoneTwo}
                  alt="iphone"
                  width="100"
                  height="100"
                ></img>
              </li>
              <li>
                <img
                  src={iphoneThree}
                  alt="iphone"
                  width="100"
                  height="100"
                ></img>
              </li>
            </PhotoWrp>
          </li>
        </ExampleStyled>
      </ExampleWrp>
    </RulsWrp>
  );
};
